# Climate Change and Deaths from Cancer Analysis

In this analysis, we would like to see the correlation between climate change and deaths from Cancer, specifically at the top 5 countries with the highest population in the world.
1. China
2. India
3. United States
4. Indonesia
5. Brazil

In [1]:
%matplotlib inline

In [2]:
# Dependencies and Set Up
import pandas as pd
import numpy as np
import requests
import json
import matplotlib.pyplot as plt
from scipy import stats

In [3]:
# Read csv for temperature by countries from 1991 to 2016
temp_china = pd.read_csv("./Resources/temperature_1991_2016_China.csv")
temp_india = pd.read_csv("./Resources/temperature_1991_2016_India.csv")
temp_usa = pd.read_csv("./Resources/temperature_1991_2016_USA.csv")
temp_indonesia = pd.read_csv("./Resources/temperature_1991_2016_Indonesia.csv")
temp_brazil = pd.read_csv("./Resources/temperature_1991_2016_Brazil.csv")

In [ ]:
# Check and print the temperature data (China)
temp_china.head()

In [ ]:
# Grouping the DataFrame by year
temp_china_by_year = temp_china.groupby(["Year"])

# Calculate the average temperature by year and print in DataFrame
temp_china_by_year_mean = pd.DataFrame(temp_china_by_year["Temperature - (Celsius)"].mean())
temp_china_by_year_mean

In [ ]:
# Plot the graph based on mean temperature in China by year (1991 to 2016)
plt.plot(temp_china_by_year_mean.index, temp_china_by_year_mean["Temperature - (Celsius)"],
        color="green")
plt.show()

In [ ]:
# Perform a linear regression on the temperature year by year
year = temp_china_by_year_mean.index
temp = temp_china_by_year_mean["Temperature - (Celsius)"]

(slope, intercept, r_value, p_value, std_err) = stats.linregress(year, temp)

# Get regression values
regress_values = year * slope + intercept
print(regress_values)

In [ ]:
# Create plot for temperature in China from 1991 to 2016 with the line regression
plt.plot(temp_china_by_year_mean.index, temp_china_by_year_mean["Temperature - (Celsius)"],
        color="green")
plt.plot(year, regress_values, color="red")
plt.title("Temperature (C) in China from 1991 to 2016")
plt.xlabel("Year")
plt.ylabel("Temperature (C)")
plt.show()

In [ ]:
# Check and print the temperature data (India)
temp_india.head()

In [ ]:
# Grouping the DataFrame by year
temp_india_by_year = temp_india.groupby(["Year"])

# Calculate the average temperature by year and print in DataFrame
temp_india_by_year_mean = pd.DataFrame(temp_india_by_year["Temperature - (Celsius)"].mean())
temp_india_by_year_mean

In [ ]:
# Perform a linear regression on the temperature year by year
year = temp_india_by_year_mean.index
temp = temp_india_by_year_mean["Temperature - (Celsius)"]

(slope, intercept, r_value, p_value, std_err) = stats.linregress(year, temp)

# Get regression values
regress_values = year * slope + intercept
print(regress_values)

In [ ]:
# Create plot for temperature in China from 1991 to 2016 with the line regression
plt.plot(temp_india_by_year_mean.index, temp_india_by_year_mean["Temperature - (Celsius)"],
        color="orange")
plt.plot(year, regress_values, color="blue")
plt.title("Temperature (C) in India from 1991 to 2016")
plt.xlabel("Year")
plt.ylabel("Temperature (C)")
plt.show()

In [ ]:
# Check and print the temperature data (USA)
temp_usa.head()

In [ ]:
# Grouping the DataFrame by year
temp_usa_by_year = temp_usa.groupby(["Year"])

# Calculate the average temperature by year and print in DataFrame
temp_usa_by_year_mean = pd.DataFrame(temp_usa_by_year["Temperature - (Celsius)"].mean())
temp_usa_by_year_mean

In [ ]:
# Check and print the temperature data (Indonesia)
temp_indonesia.head()

In [ ]:
# Check and print the temperature data (Brazil)
temp_brazil.head()

In [4]:
# Read the csv for the annual CO2 emission by country
CO2_emission = pd.read_csv("./Resources/annual_co2_emissions_by_region.csv")
CO2_emission.head()

        Entity Code  Year  Annual CO2 emissions (tonnes )
0  Afghanistan  AFG  1949                         14656.0
1  Afghanistan  AFG  1950                         84272.0
2  Afghanistan  AFG  1951                         91600.0
3  Afghanistan  AFG  1952                         91600.0
4  Afghanistan  AFG  1953                        106256.0

In [5]:
# Rename the column name
CO2_emission = CO2_emission.rename(
    columns = {"Entity": "Country", "Annual CO2 emissions (tonnes )": "CO2 emissions (tonnes)"})
CO2_emission.head()

       Country Code  Year  CO2 emissions (tonnes)
0  Afghanistan  AFG  1949                 14656.0
1  Afghanistan  AFG  1950                 84272.0
2  Afghanistan  AFG  1951                 91600.0
3  Afghanistan  AFG  1952                 91600.0
4  Afghanistan  AFG  1953                106256.0

In [6]:
# Extract only China data
columns = ["Country", "Year", "CO2 emissions (tonnes)"]

CO2_emission_china = CO2_emission.loc[(CO2_emission["Country"] == "China"), columns]
CO2_emission_china.head()

     Country  Year  CO2 emissions (tonnes)
4231   China  1751                     0.0
4232   China  1752                     0.0
4233   China  1753                     0.0
4234   China  1754                     0.0
4235   China  1755                     0.0

In [7]:
# Extract China data for 1991 to 2016 only
CO2_emission_china = CO2_emission_china.set_index("Year")

years = np.arange(1991, 2017, 1)

years_91_16 = []

for year in years:
    years_91_16.append(year)
    
# years_91_16

CO2_emission_china = CO2_emission_china.loc[years_91_16]
CO2_emission_china.head(10)

     Country  CO2 emissions (tonnes)
Year
1991   China            2.538924e+09
1992   China            2.657112e+09
1993   China            2.835795e+09
1994   China            3.010242e+09
1995   China            3.265057e+09
1996   China            3.408347e+09
1997   China            3.414549e+09
1998   China            3.265903e+09
1999   China            3.258135e+09
2000   China            3.349295e+09

In [8]:
# Extract only India data
columns = ["Country", "Year", "CO2 emissions (tonnes)"]

CO2_emission_india = CO2_emission.loc[(CO2_emission["Country"] == "India"), columns]
CO2_emission_india.head()

     Country  Year  CO2 emissions (tonnes)
9204   India  1751                     0.0
9205   India  1752                     0.0
9206   India  1753                     0.0
9207   India  1754                     0.0
9208   India  1755                     0.0

In [9]:
# Extract India data for 1991 to 2016 only
CO2_emission_india = CO2_emission_india.set_index("Year")

CO2_emission_india = CO2_emission_india.loc[years_91_16]
CO2_emission_india.head(10)

     Country  CO2 emissions (tonnes)
Year
1991   India            6.567409e+08
1992   India            6.987569e+08
1993   India            7.228943e+08
1994   India            7.642420e+08
1995   India            8.114608e+08
1996   India            8.788270e+08
1997   India            9.150493e+08
1998   India            9.335493e+08
1999   India            9.952331e+08
2000   India            1.029638e+09

In [10]:
# Extract only United States data
columns = ["Country", "Year", "CO2 emissions (tonnes)"]

CO2_emission_usa = CO2_emission.loc[(CO2_emission["Country"] == "United States"), columns]
CO2_emission_usa.head()

             Country  Year  CO2 emissions (tonnes)
19661  United States  1751                     0.0
19662  United States  1752                     0.0
19663  United States  1753                     0.0
19664  United States  1754                     0.0
19665  United States  1755                     0.0

In [11]:
# Extract United States data for 1991 to 2016 only
CO2_emission_usa = CO2_emission_usa.set_index("Year")

CO2_emission_usa = CO2_emission_usa.loc[years_91_16]
CO2_emission_usa

            Country  CO2 emissions (tonnes)
Year
1991  United States            5.070839e+09
1992  United States            5.174059e+09
1993  United States            5.284688e+09
1994  United States            5.377987e+09
1995  United States            5.439213e+09
1996  United States            5.626187e+09
1997  United States            5.703891e+09
1998  United States            5.752324e+09
1999  United States            5.832250e+09
2000  United States            6.000606e+09
2001  United States            5.902455e+09
2002  United States            5.943651e+09
2003  United States            5.991320e+09
2004  United States            6.106621e+09
2005  United States            6.132006e+09
2006  United States            6.052236e+09
2007  United States            6.130984e+09
2008  United States            5.932775e+09
2009  United States            5.495395e+09
2010  United States            5.701076e+09
2011  United States            5.570707e+09
2012  United States            5.366730e+09
2013  United States            5.519613e+09
2014  United States            5.568759e+09
2015  United States            5.420804e+09
2016  United States            5.310861e+09

In [12]:
# Extract only Indonesia data
columns = ["Country", "Year", "CO2 emissions (tonnes)"]

CO2_emission_indonesia = CO2_emission.loc[(CO2_emission["Country"] == "Indonesia"), columns]
CO2_emission_indonesia.head()

        Country  Year  CO2 emissions (tonnes)
9460  Indonesia  1889                  3664.0
9461  Indonesia  1890                 14656.0
9462  Indonesia  1891                 21984.0
9463  Indonesia  1892                179536.0
9464  Indonesia  1893                403040.0

In [13]:
# Extract Indonesia data for 1991 to 2016 only
CO2_emission_indonesia = CO2_emission_indonesia.set_index("Year")

CO2_emission_indonesia = CO2_emission_indonesia.loc[years_91_16]
CO2_emission_indonesia.head(15)

        Country  CO2 emissions (tonnes)
Year
1991  Indonesia             180695289.5
1992  Indonesia             203659373.7
1993  Indonesia             219856328.5
1994  Indonesia             222967641.4
1995  Indonesia             226669943.6
1996  Indonesia             255207090.1
1997  Indonesia             280896520.2
1998  Indonesia             216104916.5
1999  Indonesia             244101581.6
2000  Indonesia             265983184.0
2001  Indonesia             297770560.0
2002  Indonesia             307578168.0
2003  Indonesia             316854168.0
2004  Indonesia             340076520.0
2005  Indonesia             343579936.0

In [14]:
# Extract only Brazil data
columns = ["Country", "Year", "CO2 emissions (tonnes)"]

CO2_emission_brazil = CO2_emission.loc[(CO2_emission["Country"] == "Brazil"), columns]
CO2_emission_brazil.head()

     Country  Year  CO2 emissions (tonnes)
2980  Brazil  1901               2103136.0
2981  Brazil  1902               2506176.0
2982  Brazil  1903               2440224.0
2983  Brazil  1904               2619760.0
2984  Brazil  1905               2799296.0

In [15]:
# Extract Brazil data for 1991 to 2016 only
CO2_emission_brazil = CO2_emission_brazil.set_index("Year")

CO2_emission_brazil = CO2_emission_brazil.loc[years_91_16]
CO2_emission_brazil.head(15)

     Country  CO2 emissions (tonnes)
Year
1991  Brazil             217227472.0
1992  Brazil             218383504.0
1993  Brazil             228333216.0
1994  Brazil             239470720.0
1995  Brazil             255583376.0
1996  Brazil             281194784.0
1997  Brazil             296585256.0
1998  Brazil             308305720.0
1999  Brazil             316282440.0
2000  Brazil             324226040.0
2001  Brazil             332987400.0
2002  Brazil             327434832.0
2003  Brazil             317508448.0
2004  Brazil             333675144.0
2005  Brazil             342086472.0

In [16]:
# Read the csv for total cancer deaths by cancer types
cancer_deaths = pd.read_csv("./Resources/total_cancer_deaths_by_type.csv")
cancer_deaths.head()

,Entity,Code,Year,Liver cancer (deaths),Kidney cancer (deaths),Larynx cancer (deaths),Breast cancer (deaths),Thyroid cancer (deaths),Stomach cancer (deaths),Bladder cancer (deaths),...,Lip and oral cavity cancer (deaths),Brain and nervous system cancer (deaths),"Tracheal, bronchus, and lung cancer (deaths)",Gallbladder and biliary tract cancer (deaths),Malignant skin melanoma (deaths),Leukemia (deaths),Hodgkin lymphoma (deaths),Multiple myeloma (deaths),Other cancers (deaths),Non-Hodgkin lymphoma (deaths)
0,Afghanistan,AFG,1990,466.253436,80.073955,290.099710,566.064939,55.237646,2539.307228,215.632714,...,94.797076,436.803024,956.571414,158.643663,38.136505,755.346768,148.044214,73.421959,14.700016,172.0
1,Afghanistan,AFG,1991,464.137333,79.617930,293.578079,569.733770,55.733210,2578.463804,218.264694,...,96.200684,440.421855,957.902832,160.305013,38.851810,766.950668,151.982681,74.062465,14.942015,183.0
2,Afghanistan,AFG,1992,471.634765,81.300485,303.083772,596.596603,58.219683,2681.232717,223.783862,...,99.492049,473.142029,971.879501,164.741624,40.982141,826.257248,168.151360,75.965459,15.704282,197.0
3,Afghanistan,AFG,1993,480.629105,84.770448,314.296364,626.891389,61.200264,2804.991395,230.028721,...,103.130549,524.190466,986.257891,169.337997,43.499451,915.423760,188.783361,77.835488,16.748916,215.0
4,Afghanistan,AFG,1994,482.489934,87.711539,322.791026,642.000188,62.795340,2904.039548,234.441256,...,105.411865,562.052598,992.539360,172.063135,44.983330,973.560759,199.535545,78.774421,17.406808,232.0

In [ ]:
# Seeing the list of column names
list(cancer_deaths.columns)

In [17]:
# Extracting the columns for Country/Entity, Year, and deaths because of lung cancer
lung_cancer_deaths = cancer_deaths.loc[:, ["Entity", "Year", "Tracheal, bronchus, and lung cancer (deaths)"]]
lung_cancer_deaths.head()

        Entity  Year  Tracheal, bronchus, and lung cancer (deaths)
0  Afghanistan  1990                                    956.571414
1  Afghanistan  1991                                    957.902832
2  Afghanistan  1992                                    971.879501
3  Afghanistan  1993                                    986.257891
4  Afghanistan  1994                                    992.539360

In [18]:
# Rename the column name
lung_cancer_deaths = lung_cancer_deaths.rename(columns = {"Entity": "Country"})
lung_cancer_deaths.head()

       Country  Year  Tracheal, bronchus, and lung cancer (deaths)
0  Afghanistan  1990                                    956.571414
1  Afghanistan  1991                                    957.902832
2  Afghanistan  1992                                    971.879501
3  Afghanistan  1993                                    986.257891
4  Afghanistan  1994                                    992.539360

In [19]:
# Extract the deaths caused by lung cancer for China only
lung_cancer_deaths_china = lung_cancer_deaths.loc[lung_cancer_deaths["Country"] == "China"]

# Set index as year and extract the deaths caused by lung cancer in China for year 1991 to 2016 only
lung_cancer_deaths_china = lung_cancer_deaths_china.set_index("Year")
lung_cancer_deaths_china = lung_cancer_deaths_china.loc[years_91_16]

lung_cancer_deaths_china.head(15)

     Country  Tracheal, bronchus, and lung cancer (deaths)
Year
1991   China                                 247859.469602
1992   China                                 253971.277147
1993   China                                 262381.970584
1994   China                                 271850.924610
1995   China                                 283799.253508
1996   China                                 295892.292765
1997   China                                 306248.837446
1998   China                                 318104.861596
1999   China                                 330702.058709
2000   China                                 345974.727616
2001   China                                 359712.796816
2002   China                                 376293.805465
2003   China                                 394219.807218
2004   China                                 409041.666846
2005   China                                 415545.321979

In [20]:
# Extract the deaths caused by lung cancer for India only
lung_cancer_deaths_india = lung_cancer_deaths.loc[lung_cancer_deaths["Country"] == "India"]

# Set index as year and extract the deaths caused by lung cancer in India for year 1991 to 2016 only
lung_cancer_deaths_india = lung_cancer_deaths_india.set_index("Year")
lung_cancer_deaths_india = lung_cancer_deaths_india.loc[years_91_16]

lung_cancer_deaths_india.head(15)

     Country  Tracheal, bronchus, and lung cancer (deaths)
Year
1991   India                                  34477.975624
1992   India                                  35339.353411
1993   India                                  35947.473684
1994   India                                  36522.333651
1995   India                                  36995.186371
1996   India                                  38461.422220
1997   India                                  41171.042517
1998   India                                  41988.821040
1999   India                                  41943.722850
2000   India                                  43302.324688
2001   India                                  44649.766163
2002   India                                  45475.153475
2003   India                                  46232.566242
2004   India                                  46151.248404
2005   India                                  48337.664909

In [21]:
# Extract the deaths caused by lung cancer for United States only
lung_cancer_deaths_usa = lung_cancer_deaths.loc[lung_cancer_deaths["Country"] == "United States"]

# Set index as year and extract the deaths caused by lung cancer in United States for year 1991 to 2016 only
lung_cancer_deaths_usa = lung_cancer_deaths_usa.set_index("Year")
lung_cancer_deaths_usa = lung_cancer_deaths_usa.loc[years_91_16]

lung_cancer_deaths_usa.head(15)

            Country  Tracheal, bronchus, and lung cancer (deaths)
Year
1991  United States                                 155568.287806
1992  United States                                 157296.383782
1993  United States                                 162555.316866
1994  United States                                 164345.996485
1995  United States                                 167320.647505
1996  United States                                 167299.135628
1997  United States                                 167331.866462
1998  United States                                 168359.185719
1999  United States                                 170128.401449
2000  United States                                 171218.872015
2001  United States                                 172262.669547
2002  United States                                 174055.684686
2003  United States                                 174812.059973
2004  United States                                 172944.905587
2005  United States                                 174672.035074

In [22]:
# Extract the deaths caused by lung cancer for Indonesia only
lung_cancer_deaths_indonesia = lung_cancer_deaths.loc[lung_cancer_deaths["Country"] == "Indonesia"]

# Set index as year and extract the deaths caused by lung cancer in Indonesia for year 1991 to 2016 only
lung_cancer_deaths_indonesia = lung_cancer_deaths_indonesia.set_index("Year")
lung_cancer_deaths_indonesia = lung_cancer_deaths_indonesia.loc[years_91_16]

lung_cancer_deaths_indonesia.head(15)

        Country  Tracheal, bronchus, and lung cancer (deaths)
Year
1991  Indonesia                                  16413.039790
1992  Indonesia                                  17120.422992
1993  Indonesia                                  17791.908037
1994  Indonesia                                  18455.321480
1995  Indonesia                                  19150.554845
1996  Indonesia                                  19941.348825
1997  Indonesia                                  20718.031298
1998  Indonesia                                  21332.321455
1999  Indonesia                                  22026.501119
2000  Indonesia                                  22804.220900
2001  Indonesia                                  23457.387906
2002  Indonesia                                  24114.878975
2003  Indonesia                                  24718.239896
2004  Indonesia                                  25320.465969
2005  Indonesia                                  25872.515560

In [23]:
# Extract the deaths caused by lung cancer for Brazil only
lung_cancer_deaths_brazil = lung_cancer_deaths.loc[lung_cancer_deaths["Country"] == "Brazil"]

# Set index as year and extract the deaths caused by lung cancer in Brazil for year 1991 to 2016 only
lung_cancer_deaths_brazil = lung_cancer_deaths_brazil.set_index("Year")
lung_cancer_deaths_brazil = lung_cancer_deaths_brazil.loc[years_91_16]

lung_cancer_deaths_brazil.head(15)

     Country  Tracheal, bronchus, and lung cancer (deaths)
Year
1991  Brazil                                  14438.677779
1992  Brazil                                  15093.238904
1993  Brazil                                  15920.998405
1994  Brazil                                  16473.979603
1995  Brazil                                  16993.900398
1996  Brazil                                  17659.680749
1997  Brazil                                  18331.067602
1998  Brazil                                  19117.384264
1999  Brazil                                  19966.091616
2000  Brazil                                  20654.995762
2001  Brazil                                  21312.155764
2002  Brazil                                  21936.349427
2003  Brazil                                  22776.471678
2004  Brazil                                  23413.530264
2005  Brazil                                  23665.218468

In [42]:
# Read the csv for total population by region
pop = pd.read_csv("./Resources/total_population_by_region.csv")
pop.head()

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,Unnamed: 64
0,Aruba,ABW,"Population, total",SP.POP.TOTL,54211.0,55438.0,56225.0,56695.0,57032.0,57360.0,...,102046.0,102560.0,103159.0,103774.0,104341.0,104872.0,105366.0,105845.0,NaN,NaN
1,Afghanistan,AFG,"Population, total",SP.POP.TOTL,8996973.0,9169410.0,9351441.0,9543205.0,9744781.0,9956320.0,...,30117413.0,31161376.0,32269589.0,33370794.0,34413603.0,35383128.0,36296400.0,37172386.0,NaN,NaN
2,Angola,AGO,"Population, total",SP.POP.TOTL,5454933.0,5531472.0,5608539.0,5679458.0,5735044.0,5770570.0,...,24220661.0,25107931.0,26015780.0,26941779.0,27884381.0,28842484.0,29816748.0,30809762.0,NaN,NaN
3,Albania,ALB,"Population, total",SP.POP.TOTL,1608800.0,1659800.0,1711319.0,1762621.0,1814135.0,1864791.0,...,2905195.0,2900401.0,2895092.0,2889104.0,2880703.0,2876101.0,2873457.0,2866376.0,NaN,NaN
4,Andorra,AND,"Population, total",SP.POP.TOTL,13411.0,14375.0,15370.0,16412.0,17469.0,18549.0,...,83747.0,82427.0,80774.0,79213.0,78011.0,77297.0,77001.0,77006.0,NaN,NaN

In [ ]:
# pop_91_16 = pop.filter(items=["Country Name", 
#                               "1991", "1992", "1993", "1994", "1995",
#                               "1996", "1997", "1998", "1999", "2000",
#                               "2001", "2002", "2003", "2004", "2005",
#                               "2006", "2007", "2008", "2009", "2010",
#                               "2011", "2012", "2013", "2014", "2015", "2016"])
# pop_91_16 = pop_91_16.transpose()
# pop_91_16

In [43]:
# Extract the data for China and year from 1991 to 2016 only
pop_91_16 = pop.loc[:,["Country Name", 
                      "1991", "1992", "1993", "1994", "1995",
                      "1996", "1997", "1998", "1999", "2000",
                      "2001", "2002", "2003", "2004", "2005",
                      "2006", "2007", "2008", "2009", "2010",
                      "2011", "2012", "2013", "2014", "2015", "2016"]]

# Set index as Country
pop_91_16 = pop_91_16.set_index("Country Name")

# Transpose the columns and rows
pop_91_16 = pd.DataFrame.transpose(pop_91_16)

pop_91_16.head()

Country Name,Aruba,Afghanistan,Angola,Albania,Andorra,Arab World,United Arab Emirates,Argentina,Armenia,American Samoa,...,Virgin Islands (U.S.),Vietnam,Vanuatu,World,Samoa,Kosovo,"Yemen, Rep.",South Africa,Zambia,Zimbabwe
1991,64622.0,13299017.0,12248901.0,3266790.0,56671.0,228731685.0,1937153.0,33079000.0,3505258.0,48685.0,...,104807.0,69436954.0,150716.0,5.369210e+09,163997.0,1898000.0,12302124.0,37718950.0,8246656.0,10680995.0
1992,68235.0,14485546.0,12657366.0,3247039.0,58888.0,232956352.0,2052891.0,33529326.0,3442817.0,49896.0,...,105712.0,70883481.0,155170.0,5.453394e+09,165490.0,1932000.0,12954155.0,38672607.0,8451347.0,10900502.0
1993,72504.0,15816603.0,13075049.0,3227287.0,60971.0,239243261.0,2173139.0,33970111.0,3363108.0,51020.0,...,106578.0,72300308.0,159744.0,5.538449e+09,167119.0,1965000.0,13634076.0,39633750.0,8656486.0,11092766.0
1994,76700.0,17075727.0,13503747.0,3207536.0,62677.0,245449409.0,2294385.0,34402672.0,3283667.0,52095.0,...,107318.0,73651218.0,164129.0,5.622575e+09,168694.0,1997000.0,14297613.0,40564059.0,8869740.0,11261744.0
1995,80324.0,18110657.0,13945206.0,3187784.0,63850.0,253107289.0,2415090.0,34828170.0,3217348.0,53161.0,...,107818.0,74910461.0,168158.0,5.707533e+09,170054.0,2029000.0,14913315.0,41435758.0,9096607.0,11410714.0

In [44]:
pop_91_16 = pop_91_16.rename_axis("Year", axis=1)
pop_91_16.head()

Year,Aruba,Afghanistan,Angola,Albania,Andorra,Arab World,United Arab Emirates,Argentina,Armenia,American Samoa,...,Virgin Islands (U.S.),Vietnam,Vanuatu,World,Samoa,Kosovo,"Yemen, Rep.",South Africa,Zambia,Zimbabwe
1991,64622.0,13299017.0,12248901.0,3266790.0,56671.0,228731685.0,1937153.0,33079000.0,3505258.0,48685.0,...,104807.0,69436954.0,150716.0,5.369210e+09,163997.0,1898000.0,12302124.0,37718950.0,8246656.0,10680995.0
1992,68235.0,14485546.0,12657366.0,3247039.0,58888.0,232956352.0,2052891.0,33529326.0,3442817.0,49896.0,...,105712.0,70883481.0,155170.0,5.453394e+09,165490.0,1932000.0,12954155.0,38672607.0,8451347.0,10900502.0
1993,72504.0,15816603.0,13075049.0,3227287.0,60971.0,239243261.0,2173139.0,33970111.0,3363108.0,51020.0,...,106578.0,72300308.0,159744.0,5.538449e+09,167119.0,1965000.0,13634076.0,39633750.0,8656486.0,11092766.0
1994,76700.0,17075727.0,13503747.0,3207536.0,62677.0,245449409.0,2294385.0,34402672.0,3283667.0,52095.0,...,107318.0,73651218.0,164129.0,5.622575e+09,168694.0,1997000.0,14297613.0,40564059.0,8869740.0,11261744.0
1995,80324.0,18110657.0,13945206.0,3187784.0,63850.0,253107289.0,2415090.0,34828170.0,3217348.0,53161.0,...,107818.0,74910461.0,168158.0,5.707533e+09,170054.0,2029000.0,14913315.0,41435758.0,9096607.0,11410714.0

In [45]:
# Extract the population data for China only and rename the column name to "Population"
pop_china = pop_91_16.loc[:, ["China"]]
pop_china = pop_china.rename(columns = {"China": "Population"})
pop_china.index = pop_china.index.astype("int64")
pop_china.head()

Year    Population
1991  1.150780e+09
1992  1.164970e+09
1993  1.178440e+09
1994  1.191835e+09
1995  1.204855e+09

In [ ]:
# Extract the population data for India only and rename the column name to "Population"
pop_india = pop_91_16.loc[:, ["India"]]
pop_india = pop_india.rename(columns = {"India": "Population"})
pop_india.index = pop_india.index.astype("int64")
pop_india.head()

In [ ]:
# Extract the population data for United States only and rename the column name to "Population"
pop_usa = pop_91_16.loc[:, ["United States"]]
pop_usa = pop_usa.rename(columns = {"United States": "Population"})
pop_usa.index = pop_usa.index.astype("int64")
pop_usa.head()

In [ ]:
# Extract the population data for Indonesia only and rename the column name to "Population"
pop_indonesia = pop_91_16.loc[:, ["Indonesia"]]
pop_indonesia = pop_indonesia.rename(columns = {"Indonesia": "Population"})
pop_indonesia.index = pop_indonesia.index.astype("int64")
pop_indonesia.head()

In [ ]:
# Extract the population data for Brazil only and rename the column name to "Population"
pop_brazil = pop_91_16.loc[:, ["Brazil"]]
pop_brazil = pop_brazil.rename(columns = {"Brazil": "Population"})
pop_brazil.index = pop_brazil.index.astype("int64")
pop_brazil.head()

In [28]:
lung_cancer_deaths_china.head()

     Country  Tracheal, bronchus, and lung cancer (deaths)
Year
1991   China                                 247859.469602
1992   China                                 253971.277147
1993   China                                 262381.970584
1994   China                                 271850.924610
1995   China                                 283799.253508

In [29]:
lung_cancer_deaths_china = lung_cancer_deaths_china.rename_axis(index=None, columns="Year")
lung_cancer_deaths_china.head()

Year Country  Tracheal, bronchus, and lung cancer (deaths)
1991   China                                 247859.469602
1992   China                                 253971.277147
1993   China                                 262381.970584
1994   China                                 271850.924610
1995   China                                 283799.253508

In [31]:
lung_cancer_deaths_china.index

Int64Index([1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001,
            2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012,
            2013, 2014, 2015, 2016],
           dtype='int64')

In [46]:
pop_china.index

Int64Index([1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001,
            2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012,
            2013, 2014, 2015, 2016],
           dtype='int64')

In [ ]:
list(lung_cancer_deaths_china.columns)

In [ ]:
list(pop_china.columns)

In [48]:
# Merge population data with the total deaths caused by lung cancer deaths, to get the percentage of people 
# that were died because of lung cancer in each country
lung_cancer_deaths_total_pop_china = pop_china.merge(lung_cancer_deaths_china, how="outer",
                                                     left_index=True, right_index=True)
lung_cancer_deaths_total_pop_china

Year    Population Country  Tracheal, bronchus, and lung cancer (deaths)
1991  1.150780e+09   China                                 247859.469602
1992  1.164970e+09   China                                 253971.277147
1993  1.178440e+09   China                                 262381.970584
1994  1.191835e+09   China                                 271850.924610
1995  1.204855e+09   China                                 283799.253508
1996  1.217550e+09   China                                 295892.292765
1997  1.230075e+09   China                                 306248.837446
1998  1.241935e+09   China                                 318104.861596
1999  1.252735e+09   China                                 330702.058709
2000  1.262645e+09   China                                 345974.727616
2001  1.271850e+09   China                                 359712.796816
2002  1.280400e+09   China                                 376293.805465
2003  1.288400e+09   China                                 394219.807218
2004  1.296075e+09   China                                 409041.666846
2005  1.303720e+09   China                                 415545.321979
2006  1.311020e+09   China                                 422144.556665
2007  1.317885e+09   China                                 439170.812570
2008  1.324655e+09   China                                 458677.320455
2009  1.331260e+09   China                                 482630.600273
2010  1.337705e+09   China                                 506593.386808
2011  1.344130e+09   China                                 531274.142021
2012  1.350695e+09   China                                 555474.003687
2013  1.357380e+09   China                                 574420.601969
2014  1.364270e+09   China                                 612780.701658
2015  1.371220e+09   China                                 656725.558736
2016  1.378665e+09   China                                 685286.392715

In [ ]:
# Plot the graph based on CO2 emission data for China
plt.plot(CO2_emission_china.index, CO2_emission_china["CO2 emissions (tonnes)"], 
         color="red", marker="o", markersize=5, linewidth=0.5)

plt.show()

In [ ]:
# Plot the graph based on lung cancer deaths data for China 
plt.plot(lung_cancer_deaths_china.index, lung_cancer_deaths_china["Tracheal, bronchus, and lung cancer (deaths)"],
        color="blue", marker="o", markersize=5, linewidth=0.5)
plt.show()

In [ ]:
# Plot both CO2 emission and lung cancer deaths data for China in one graph
years = np.arange(1991, 2017, 1)

years_label = []
for year in years:
    years_label.append(year)

fig, ax1 = plt.subplots(figsize=(10,10))

ax1.plot(years, CO2_emission_china["CO2 emissions (tonnes)"],
        color="red", linewidth=1)
ax1.set_xlabel("Year")
ax1.set_ylabel("CO2 Emissions in China (Tonnes)", color="red")
ax1.set_xticks(years_label)
ax1.set_xticklabels(years_label, rotation=45)

ax2 = ax1.twinx()

ax2.plot(years, lung_cancer_deaths_china["Tracheal, bronchus, and lung cancer (deaths)"],
        color="blue", linewidth=1)
ax2.set_ylabel("Tracheal, bronchus, and lung cancer (deaths)", color="blue")

# fig.tight_layout()
plt.title("CO2 Emissions and Deaths Caused by Tracheal, Bronchus, Lung Cancer in China from 1991 to 2016")
plt.show()

In [ ]:
# Plot both CO2 emission and lung cancer deaths data for India in one graph
years = np.arange(1991, 2017, 1)

years_label = []
for year in years:
    years_label.append(year)

fig, ax1 = plt.subplots(figsize=(10,10))

ax1.plot(years, CO2_emission_india["CO2 emissions (tonnes)"],
        color="red", linewidth=1)
ax1.set_xlabel("Year")
ax1.set_ylabel("CO2 Emissions in India (Tonnes)", color="red")
ax1.set_xticks(years_label)
ax1.set_xticklabels(years_label, rotation=45)

ax2 = ax1.twinx()

ax2.plot(years, lung_cancer_deaths_india["Tracheal, bronchus, and lung cancer (deaths)"],
        color="blue", linewidth=1)
ax2.set_ylabel("Tracheal, bronchus, and lung cancer (deaths)", color="blue")

# fig.tight_layout()
plt.title("CO2 Emissions and Deaths Caused by Tracheal, Bronchus, Lung Cancer in India from 1991 to 2016")
plt.show()

In [ ]:
# Plot both CO2 emission and lung cancer deaths data for United States in one graph
years = np.arange(1991, 2017, 1)

years_label = []
for year in years:
    years_label.append(year)

fig, ax1 = plt.subplots(figsize=(10,10))

ax1.plot(years, CO2_emission_usa["CO2 emissions (tonnes)"],
        color="red", linewidth=1)
ax1.set_xlabel("Year")
ax1.set_ylabel("CO2 Emissions in USA (Tonnes)", color="red")
ax1.set_xticks(years_label)
ax1.set_xticklabels(years_label, rotation=45)

ax2 = ax1.twinx()

ax2.plot(years, lung_cancer_deaths_usa["Tracheal, bronchus, and lung cancer (deaths)"],
        color="blue", linewidth=1)
ax2.set_ylabel("Tracheal, bronchus, and lung cancer (deaths)", color="blue")

# fig.tight_layout()
plt.title("CO2 Emissions and Deaths Caused by Tracheal, Bronchus, Lung Cancer in United States from 1991 to 2016")
plt.show()

In [ ]:
# Plot both CO2 emission and lung cancer deaths data for Indonesia in one graph
years = np.arange(1991, 2017, 1)

years_label = []
for year in years:
    years_label.append(year)

fig, ax1 = plt.subplots(figsize=(10,10))

ax1.plot(years, CO2_emission_indonesia["CO2 emissions (tonnes)"],
        color="red", linewidth=1)
ax1.set_xlabel("Year")
ax1.set_ylabel("CO2 Emissions in Indonesia (Tonnes)", color="red")
ax1.set_xticks(years_label)
ax1.set_xticklabels(years_label, rotation=45)

ax2 = ax1.twinx()

ax2.plot(years, lung_cancer_deaths_indonesia["Tracheal, bronchus, and lung cancer (deaths)"],
        color="blue", linewidth=1)
ax2.set_ylabel("Tracheal, bronchus, and lung cancer (deaths)", color="blue")

# fig.tight_layout()
plt.title("CO2 Emissions and Deaths Caused by Tracheal, Bronchus, Lung Cancer in Indonesia from 1991 to 2016")
plt.show()

In [ ]:
# Plot both CO2 emission and lung cancer deaths data for Brazil in one graph
years = np.arange(1991, 2017, 1)

years_label = []
for year in years:
    years_label.append(year)

fig, ax1 = plt.subplots(figsize=(10,10))

ax1.plot(years, CO2_emission_brazil["CO2 emissions (tonnes)"],
        color="red", linewidth=1)
ax1.set_xlabel("Year")
ax1.set_ylabel("CO2 Emissions in Brazil (Tonnes)", color="red")
ax1.set_xticks(years_label)
ax1.set_xticklabels(years_label, rotation=45)

ax2 = ax1.twinx()

ax2.plot(years, lung_cancer_deaths_brazil["Tracheal, bronchus, and lung cancer (deaths)"],
        color="blue", linewidth=1)
ax2.set_ylabel("Tracheal, bronchus, and lung cancer (deaths)", color="blue")

# fig.tight_layout()
plt.title("CO2 Emissions and Deaths Caused by Tracheal, Bronchus, Lung Cancer in Brazil from 1991 to 2016")
plt.show()